Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/consumer_protection/product_safety_and_labelling/safety_of_personal_protective_equipment.html.txt.tmx
Source language: en
Languages: ga

source: Safety of Personal Protective Equipment
ga: Sábháilteacht Trealamh Cosanta Pearsanta

source: Personal Protective Equipment is any device or appliance designed to protect against health and safety hazards in your daily activities
ga: Is éard is ciall le Trealamh Cosanta Pearsanta ná aon ghléasra nó fearas atá déanta chun cosaint a thabhairt in aghaidh chontúirtí sláinte agus sábháilteachta agus tú i mbun gníomhaíochtaí ó lá go lá

source: Personal protective equipment covers a broad range of items from simple devices like sunglasses, bicycle helmets and reflective jackets to chemical hazard suits and safety harnesses
ga: Clúdaíonn trealamh cosanta pearsanta réimse leathan rudaí ó ghléasraí simplí ar nós spéaclaí gréine, clogaid rothair agus seaicéid fhrithchaiteacha go dtí culaith in aghaidh contúirt cheimiceach agus úimeanna sábháilteachta

source: A specific law (S.I
ga: Clúdaíonn dlí ar leithligh (I.R

source: No 272 of 1993 EC (Personal Protective Equipment) Regulations, 1993) (as amended) covers these items
ga: Uimh 272 de Rialacháin CE 1993 (Trealamh Cosanta Pearsanta), 1993 na hábhair sin

source: The law states that all personal protective equipment must preserve health and ensure the safety of users
ga: Luann an dlí gur chóir do gach trealamh cosanta pearsanta sláinte a chaomhnú agus sábháilteacht úsáideoirí a chinntiú

source: Personal protective equipment must not harm other people, domestic animals or property
ga: Ní fhéadfaidh trealamh cosanta pearsanta dochar a dhéanamh do dhaoine eile, d'ainmhithe tí ná d’áitreabh

source: All of these items should be properly maintained by the user and used for their intended purposes
ga: Ba chóir don úsáideoir na hábhair seo ar fad a chothabháil i gceart agus iad a úsáid chun na críocha atá beartaithe dóibh amháin

source: Attached warnings and instructions should always be followed
ga: Ba chóir rabhaidh agus treoracha a bhíonn faoi iamh leo a leanúint i gcónaí

source: The law covers all personal protective equipment whether it is used in the home, for leisure purposes or at work
ga: Clúdaíonn an dlí gach trealamh cosanta pearsanta bíodh sé in úsáid sa bhaile, chun críocha áineasa nó ar obair

source: The Competition and Consumer Protection Commission has responsibility to check that personal protective equipment used in leisure pursuits or in the home complies with the law
ga: Tá freagracht ar an Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí (CCPC) seiceáil go gcomhlíonann trealamh cosanta pearsanta a úsáidtear ar mhaithe le háineasa nó sa bhaile an dlí

source: The Health and Safety Authority Monitors all personal protective equipment used in business and industry
ga: Déanann an tÚdarás Sláinte agus Sábháilteachta monatóireacht ar gach trealamh cosanta pearsanta a úsáidtear i ngnó agus i dtionscail

source: The use of safety equipment on any mechanically-propelled pleasure craft is covered by the Merchant Shipping (Mechanically Propelled Pleasure Craft) (Safety) Regulations, 2001 and the Merchant Shipping (Pleasure Craft) (Lifejackets and Operation) (Safety) Regulations 2004
ga: Clúdaíonn Rialacháin Loingis Cheannaíochta (Árthaigh Áineasa Liánta go Meicniúil) (Sábháilteacht), 2001 agus Rialacháin Loingis Cheannaíochta (Árthaigh Áineasa) (Seaicéid Tharrthála agus Oibríocht) (Sábháilteacht) , 2004 úsáid trealamh sábháilteachta ar aon árthach áineasa atá liánta go meicniúil

source: This includes motorboats, powerboats, fast powerboats (those than can travel at a speed of 17 knots) and personal watercraft, commonly referred to as jet skis
ga: Áirítear leis sin mótarbháid, báid , chumhachtacha báid chumhachtacha tapa (iad sin a thaistealaíonn ag luas 17 muirmhíle) agus árthaigh uisce pearsanta, a dtugtar scaird-scí orthu de ghnáth

source: You can read more about personal protective equipment on pleasure craft here
ga: Léigh tuilleadh faoi threalamh cosanta pearsanta ar árthaigh áineasa anseo
